spicahan/qrp_companion/sdkconfig.defaults
# Target: ESP32-P4 (M5Stack Tab5)
CONFIG_IDF_TARGET="esp32p4"

# Required for 200MHz PSRAM
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# PSRAM (required by M5GFX for Tab5)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# Place malloc in PSRAM when internal memory is exhausted
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# USB Host for UAC audio input
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048

# WiFi AP for web UI (esp_hosted 1.4.0 matching factory C6 firmware)
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_LWIP_LOCAL_HOSTNAME="qrp-companion"

# ESP-Hosted 1.4.0 SDIO transport (Tab5: P4 ↔ C6, matching factory demo)
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=15
